Revit 2026 API

# DocumentChangedEventArgs Class

---

The event arguments used by the DocumentChanged event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.DB.EventsDocumentChangedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentChangedEventArgs : RevitAPISingleEventArgs
```
```vb
Public Class DocumentChangedEventArgs
	Inherits RevitAPISingleEventArgs
```
```cpp
public ref class DocumentChangedEventArgs : public RevitAPISingleEventArgs
```
```fsharp
type DocumentChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
```

The DocumentChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Operation | The operation associated with this event |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAddedElementIds | Returns set of elements newly added to the document. |
|  | GetAddedElementIds(ElementFilter) | Returns set of newly added elements that pass the filter. |
|  | GetDeletedElementIds | Returns set of elements that were deleted from the document. |
|  | GetDocument | Returns document associated with this event |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModifiedElementIds | Returns set of elements that were modified. |
|  | GetModifiedElementIds(ElementFilter) | Returns set of elements that were modified according to the given element filter. |
|  | GetTransactionNames | Returns names of the transactions associated with this event |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace